Revit 2024 API
MasonryCMU Class
 A static class that provides access to the property names that appear in the MasonryCMU visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class MasonryCMU
Visual Basic
Public NotInheritable Class MasonryCMU
Visual C++
public ref class MasonryCMU abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.MasonryCMU
See Also
MasonryCMU Members
Autodesk.Revit.DB.Visual Namespace